{"url": "https://stackoverflow.com/", "title": "Newest Questions - Stack Overflow", "description": "", "article_text": "Newest Questions Ask Question 24,246,558 questions Newest Active Bountied 69 Unanswered More Bountied 69 Unanswered Frequent Score Trending Week Month Unanswered (my tags) Filter Filter by No answers No accepted answer Has bounty Days old Sorted by Newest Recent activity Highest score Most frequent Bounty ending soon Trending Most activity Tagged with My watched tags The following tags: Apply filter Cancel 0 votes 0 answers 6 views How to detect if multiple instances of an app are installed on an Android device Hey Android Developers and Security Experts\n\nSome users could install multi instances of my app (with same package name) on ONE device.\n\nSome of them use apps such as Parallel Space, Dual Space, Clone ... Mobile Development Collective java android kotlin security reza laki 101 asked 5 mins ago 0 votes 0 answers 10 views Can I link Python onto an Arduino? I made it so when you press a button on an Arduino Leonardo, it opens an application on my MacBook. I made this using serial print to link to Python and use Python to open the application. Is there ... python arduino Lukas Sanders 3 asked 8 mins ago 1 vote 0 answers 7 views Configure apache to serve Laravel app alongside regular app My website runs with the following virtual host configuration:\n<IfModule mod_ssl.c>\n<VirtualHost *:443>\n    DocumentRoot /home/myuser/MyDomain/src\n    ServerName MyDomain.com\n    ... PHP Collective php laravel apache sanjihan 6,046 asked 8 mins ago 0 votes 0 answers 5 views How to enable iPhone hotspot using WiFi as internet source instead of cellular data? I have a question about iPhone hotspot (iPhone 15 Pro). Whenever I turn the hotspot on, the phone will automatically turn off the wifi connection and use cellular data (mobile data) as the source for ... Mobile Development Collective android ios iphone hardware huawei-mobile-services AIIA 33 asked 9 mins ago 0 votes 0 answers 7 views GCP VM Migration - Replication Completed but Cutover Options Disabled Issue Summary:\nI am migrating an AWS VM instance (np-g-wally-devtest) to GCP using the Google Cloud VM Migration service. The replication has clearly completed successfully, but the cutover options ... Google Cloud Collective google-cloud-platform cloud google-compute-engine google-migrate-for-compute-engine Safdar Mirza 97 asked 13 mins ago 0 votes 0 answers 5 views Excel statistics for subtotal table values I've been trying to create an excel analysis with the following statistics for each of the _count columns in my data set:\n\nMAX\nMIN\nMEAN\nMEDIAN\nMODE\n\nFurthermore, I have additional requirements that ... excel excel-formula statistics subtotal Paul 7 asked 16 mins ago 0 votes 0 answers 13 views Is there an API endpoint available for Copilot studio? I'm trying to schedule automatic uploads of knowledge files to my Copilot studio agent periodically. Is there any API endpoint for copilot studio which I can call from a script to upload the knowledge ... excel rest Jayarag A V 1 asked 27 mins ago 0 votes 0 answers 11 views I get the error ”Exception: Field SDK_INT or type signature not found“ in Unity I'm trying to launch my project, but unity gives the error \"Exception: Field SDK_INT or type signature  not found\". What is it and how can I fix it?\nComplete error message from Unity console:... Mobile Development Collective android unity-game-engine exception sdk Вадим Ткаченко 1 asked 31 mins ago 0 votes 0 answers 21 views How to draw an SVG shape in XAML? [duplicate] Not long ago, I started studying XAML and WPF. I can't find any information on how to draw SVG icons. If SVG can be inserted somehow, it would certainly make things much easier. I'm trying to draw ... c# wpf image xaml svg RoDeZ 33 asked 37 mins ago 0 votes 0 answers 11 views Data after MPI does not match Good afternoon! Could you please tell me why in the program when running the regular version and via MPI the matrix data do not coincide? Where is the problem in the code? Below is the main program ... c mpi Zoow 41 asked 38 mins ago 1 vote 0 answers 13 views How to local test a java AWS lambda function using LocalStack I was following the article baeldung site\nI did the step\ndocker run \\\n    --rm -it \\\n    -p 127.0.0.1:4566:4566 \\\n    -v /var/run/docker.sock:/var/run/docker.sock \\\n    -v ./target:/opt/code/... AWS Collective java amazon-web-services aws-lambda localstack Kris Swat 1,026 asked 38 mins ago 0 votes 0 answers 9 views I run dmesg | grep error I got this nouveau 0000:06:00.0: gr: DATA_ERROR 0000000c [INVALID_BITFIELD] My desktop has a weird behavior when booting, so I run\nsudo dmesg | grep error\n\nand I got this output:\n[   16.105169] nouveau 0000:06:00.0: gr: DATA_ERROR 0000000c [INVALID_BITFIELD]\n[   30.639290] ... fedora hjmnzs 141 asked 41 mins ago 0 votes 0 answers 31 views Why can I pass a function return 64bit int as hasher? #include <iostream>\n#include <unordered_map>\n#include <iterator>\n\nusing namespace std;\nclass point\n{\npublic:\n    float x, y;\n    point() = default;\n    point(float _x, f", "scrape_time": "2025-03-09T11:56:45.760430", "scraper_used": "scrapingbee"}